app/Controllers/Aturakun.php

    public function masyarakat()
    {
        $masyarakat = $this->MasyarakatModel->findAll();
---
SELECT *
FROM `masyarakat`