app/Controllers/Auth.php

    public function valid_login()
    {
        //ambil data dari form
        $data = $this->request->getPost();

        //ambil data masyarakat di database yang usernamenya sama
        $masyarakat = $this->masyarakatModel->where('username', $data['username'])->first();
        $masyarakat2 = $this->masyarakatModel->where('email', $data['username'])->first();
        $petugas = $this->PetugasModel->where('username',$data['username'])->first();
---
SELECT *
FROM `masyarakat`
WHERE `username` = 'haha'
 LIMIT 1
SELECT *
FROM `masyarakat`
WHERE `email` = 'haha'
 LIMIT 1
SELECT *
FROM `petugas`
WHERE `username` = 'haha'
 LIMIT 1