app/Controllers/Laporan.php

    public function Laporan()
    {
        $laporan = $this->request->getPost();

        if($laporan['format'] == 'Harian')
        {
            $endDate = null;
            $pengaduan = $this->PengaduanModel->where('DATE(tanggal_filter)',$laporan['tanggal'])->findAll();
        }
        elseif($laporan['format'] == 'Mingguan')
        {
            $endDate = date('Y-m-d', strtotime($laporan['tanggal'] . ' -6 days'));
            $pengaduan = $this->PengaduanModel->where('DATE(tanggal_filter) <=',$laporan['tanggal'])->where('DATE(tanggal_filter) >=',$endDate)->findAll();
        }
        elseif($laporan['format'] == 'Bulanan')
        {
            $endDate = date('Y-m-d', strtotime($laporan['tanggal'] . ' -29 days'));
            $pengaduan = $this->PengaduanModel->where('DATE(tanggal_filter) <=',$laporan['tanggal'])->where('DATE(tanggal_filter) >=',$endDate)->findAll();
        }
        elseif($laporan['format'] == 'Tahunan')
        {
            $endDate = date('Y-m-d', strtotime($laporan['tanggal'] . ' -364 days'));
            $pengaduan = $this->PengaduanModel->where('DATE(tanggal_filter) <=',$laporan['tanggal'])->where('DATE(tanggal_filter) >=',$endDate)->findAll();
---
SELECT *
FROM `pengaduan`
WHERE DATE(tanggal_filter) = '2023-11-19'
SELECT *
FROM `pengaduan`
WHERE DATE(tanggal_filter) <= '2023-11-19'
AND DATE(tanggal_filter) >= '2022-11-20'