app/Controllers/Pengaduan.php

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '6'
 LIMIT 1
---
    public function update_pengaduan($id = null)
    {
        $pengaduan = $this->PengaduanModel->where("id_pengaduan",$id)->first();

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '6'
 LIMIT 1
---
    public function delete_pengaduan($id = null)
    {
        if($id)
        {
            $pengaduan = $this->PengaduanModel->where("id_pengaduan",$id)->first();

SELECT *
FROM `pengaduan`
SELECT *
FROM `tanggapan`
---
    public function list_pengaduan()
    {
        $pengaduan = $this->PengaduanModel->findAll();
        $tanggapan = $this->TanggapanModel->findAll();

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '8'
 LIMIT 1
SELECT *
FROM `masyarakat`
WHERE `id_masyarakat` = '7'
 LIMIT 1
SELECT *
FROM `tanggapan`
WHERE `id_pengaduan` = '8'
ORDER BY `id_tanggapan` DESC
---
    public function pengaduan_satuan($id = null)
    {
        $pengaduan = $this->PengaduanModel->where('id_pengaduan',$id)->first();
        $masyrakat = $this->MasyarakatModel->where('id_masyarakat',$pengaduan['id_masyarakat'])->first();
        $tanggapan = $this->TanggapanModel->where('id_pengaduan',$pengaduan['id_pengaduan'])->orderBy('id_tanggapan','desc')->findAll();

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '8'
 LIMIT 1
---
    public function terima_pengaduan($id = null)
    {
        if($id != null)
        {
            date_default_timezone_set('Asia/Jakarta');
            $data = array(
                'status' => '1'
            );
            $this->PengaduanModel->update_data($id,$data);
            $tanggapan_data = array(
                'id_pengaduan' => $id,
                'id_petugas' => $this->session->get('id'),
                'tanggapan' => 'Pengaduan telah diverifikasi',
                'tanggal' => date("l j F H:i"),
            );