app/Controllers/User.php

SELECT *
FROM `masyarakat`
WHERE `id_masyarakat` = '7'
 LIMIT 1
SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
AND `status` = '0'
SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
AND `status` = '1'
SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
AND `status` = '2'
SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
AND `status` = '3'
SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
AND `status` = '4'
SELECT *
FROM `tanggapan`
ORDER BY `id_tanggapan` DESC
---
    public function index()
    {
        $masyarakat = $this->MasyarakatModel->where("id_masyarakat",$this->session->get('id'))->first();

        $pengaduan_dibuat = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->where("status",'0')->findAll();
        $pengaduan_diterima = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->where("status",'1')->findAll();
        $pengaduan_ditanggapi = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->where("status",'2')->findAll();
        $pengaduan_selesai = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->where("status",'3')->findAll();
        $pengaduan_ditolak = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->where("status",'4')->findAll();


        $tanggapan = $this->TanggapanModel->orderBy('id_tanggapan','desc')->findAll();