app/Controllers/User.php

SELECT *
FROM `pengaduan`
WHERE `id_masyarakat` = '7'
SELECT *
FROM `tanggapan`
---
    public function index()
    {
        $pengaduan = $this->PengaduanModel->where("id_masyarakat",$this->session->get('id'))->findAll();
        $tanggapan = $this->TanggapanModel->findAll();