app/Models/Adminmenu.php

UPDATE `adminmenu` SET `url` = 'pengaduan'
WHERE `id` = '2'
---
    public function update_data($data,$id)
    {
        $query = $this->db->table($this->table)->where('id', $id)->update($data);