app/Models/PengaduanModel.php

UPDATE `pengaduan` SET `status` = '1'
WHERE `id_pengaduan` = '8'
---
    public function update_data($id, $data)
    {
        $query = $this->db->table($this->table)->where('id_pengaduan', $id)->update($data);