app/Models/TanggapanModel.php

INSERT INTO `tanggapan` (`id_pengaduan`, `id_petugas`, `tanggapan`, `tanggal`) VALUES ('8', '1', 'Pengaduan telah diverifikasi', 'Friday 1 December 2023 17:32')
---
    public function create($data)
    {
        $query = $this->db->table($this->table)->insert($data);